#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0421\u043e\u0437\u0434\u0430\u0435\u0442 \u0441\u0446\u0435\u043d\u0430\u0440\u0438\u0439 \u0433\u043e\u043b\u043e\u0441\u043e\u0432\u043e\u0433\u043e \u043e\u0431\u0449\u0435\u043d\u0438\u044f
@class#description \u0421\u043e\u0437\u0434\u0430\u0435\u0442 \u0441\u0446\u0435\u043d\u0430\u0440\u0438\u0439 \u0433\u043e\u043b\u043e\u0441\u043e\u0432\u043e\u0433\u043e \u043e\u0431\u0449\u0435\u043d\u0438\u044f. \
    <p/>\
    \u041f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f: \
    <ul>\
    <li><b>conversationState</b> (<i>ConversationScenarioState</i>) - \u043f\u0440\u0435\u0434\u043e\u0441\u0442\u0430\u0432\u043b\u044f\u0435\u0442 \u0434\u043e\u0441\u0442\u0443\u043f \
        \u043a \u0442\u0435\u043a\u0443\u0449\u0435\u043c\u0443 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u044e \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430</li> \
    <li><b>dtmf</b> (<i>String</i>) - \u0442\u0435\u043a\u0443\u0449\u0438\u0439, \u043f\u043e\u0441\u043b\u0430\u043d\u043d\u044b\u0439 \u043e\u043f\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u043c, \u0441\u0438\u043c\u0432\u043e\u043b DTMF. \
        \u0412 \u043d\u0430\u0447\u0430\u043b\u0435 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430 (\u0442.\u0435. \u043f\u0440\u0438 \u043f\u0435\u0440\u0432\u043e\u043c \u043e\u0431\u0440\u0430\u0449\u0435\u043d\u0438\u0438 \u043a \u0441\u0446\u0435\u043d\u0430\u0440\u0438\u044e) \u0438\u043b\u0438 \u043f\u0440\u0438 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0435 \u0432 \u0442\u043e\u0447\u043a\u0443 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430 \
        (<i>ConversationScenarioPointNode</i>) \u043f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f <i>GotoNode</i> \u0438\u043b\u0438 \u0438\u043d\u044b\u043c\u0438 \u0441\u043b\u043e\u0432\u0430\u043c\u0438 \u043f\u0440\u0438 \u043b\u044e\u0431\u043e\u043c \
        \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0435 \u043d\u0435 \u0438\u043d\u0438\u0446\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u043e\u043c \u043e\u043f\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439 \u0431\u0443\u0434\u0435\u0442 \u0441\u0438\u043c\u0432\u043e\u043b <b>-</b>. \
    </li>\
    <li><b>repetitionCount</b> (<i>Integer</i>) - \u043a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u043f\u043e\u0432\u0442\u043e\u0440\u043e\u0432 \u0442\u0435\u043a\u0443\u0449\u0435\u0439 \u0442\u043e\u0447\u043a\u0438 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430</li>\
    <li><b>number</b> (<i>String</i>) - \u043d\u043e\u043c\u0435\u0440 \u0410</li>\
    <li><b>calledNumber</b> (<i>String</i>) - \u043d\u043e\u043c\u0435\u0440 \u0411</li>\
    <li><b>vars</b> (<i>Map<String, Object></i>) - \u0430\u0441\u0441\u043e\u0446\u0438\u0430\u0442\u0438\u0432\u043d\u044b\u0439 \u043c\u0430\u0441\u0441\u0438\u0432 \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043c\u043e\u0436\u043d\u043e \u0441\u043e\u0445\u0440\u0430\u043d\u044f\u0442\u044c \u043f\u0440\u043e\u0438\u0437\u0432\u043e\u043b\u044c\u043d\u044b\u0435 \u0434\u0430\u043d\u043d\u044b\u0435 \
      , \u0441\u0432\u044f\u0437\u0430\u043d\u043d\u044b\u0435 \u0441 \u0441\u0446\u0435\u043d\u0430\u0440\u0438\u0435\u043c. \u041e\u0431\u043b\u0430\u0441\u0442\u044c \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f <i>CONVERSATION</i></li>\
    </ul>\

validDtmfs#description \u041e\u043f\u0440\u0435\u0434\u0435\u043b\u044f\u0435\u0442 \u043d\u0430\u0431\u043e\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u043e\u0432 DTMF \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u044b \u0432 \u0434\u0430\u043d\u043d\u043e\u0439 \u0442\u043e\u0447\u043a\u0435 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430. \
    \u0415\u0441\u043b\u0438 \u043e\u0442 \u043e\u043f\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u043f\u0440\u0438\u0448\u0435\u043b DTMF \u0441\u0438\u043c\u0432\u043e\u043b \u043d\u0435 \u0432\u0445\u043e\u0434\u044f\u0449\u0438\u0439 \u0432 \u043d\u0430\u0431\u043e\u0440 \u0442\u043e\u0433\u0434\u0430 \u043e\u043d \u0431\u0443\u0434\u0435\u0442 \u0438\u0433\u043d\u043e\u0440\u0438\u0440\u043e\u0432\u0430\u043d. \
    \u0415\u0441\u043b\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0434\u0430\u043d\u043d\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e \u0442\u043e\u0433\u0434\u0430 \u0432\u0441\u0435 \u043f\u0440\u0438\u0445\u043e\u0434\u044f\u0449\u0438\u0435 DTMF \u0441\u0438\u043c\u0432\u043e\u043b\u044b \u0431\u0443\u0434\u0443\u0442 \u0438\u0433\u043d\u043e\u0440\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f