#  Copyright 2011 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

rtpStreamManager#description \u041c\u0435\u043d\u0435\u0434\u0436\u0435\u0440 RTP \u043f\u043e\u0442\u043e\u043a\u043e\u0432
address#description \u0410\u0434\u0440\u0435\u0441\u0441 (\u043d\u043e\u043c\u0435\u0440) \u0442\u0435\u0440\u043c\u0438\u043d\u0430\u043b\u0430
executorService#description \u0421\u0435\u0440\u0432\u0438\u0441 \u043f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0442\u0435\u0440\u043c\u0438\u043d\u0430\u043b \u0431\u0443\u0434\u0435\u0442 \u0432\u044b\u043f\u043e\u043b\u043d\u044f\u0442\u044c \u0430\u0441\u0438\u043d\u0445\u0440\u043e\u043d\u043d\u044b\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f
codec#description \u041a\u043e\u0434\u0435\u043a \u043a\u043e\u0442\u043e\u0440\u044b\u043c \u0431\u0443\u0434\u0443\u0442 \u043a\u043e\u0434\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0430\u0443\u0434\u0438\u043e \u0434\u0430\u043d\u043d\u044b\u0435
rtpPacketSize#description \u0420\u0430\u0437\u043c\u0435\u0440 rtp \u043f\u0430\u043a\u0435\u0442\u0430 \u0432 \u0431\u0438\u0442\u0430\u0445. \u0414\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f: 160, 240, 320. \
    \u0415\u0441\u043b\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043e \u0442\u043e\u0433\u0434\u0430 \u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u043f\u0430\u043a\u0435\u0442\u0430 \u0431\u0443\u0434\u0435\u0442 \u0431\u0440\u0430\u0442\u044c\u0441\u044f \u0440\u0430\u0437\u043c\u0435\u0440 \u043f\u0440\u0435\u0434\u043b\u043e\u0436\u0435\u043d\u043d\u044b\u0439 CCM.
rtpMaxSendAheadPacketsCount#description \u041c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u043e\u0435 \u043a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u043f\u0430\u043a\u0435\u0442\u043e\u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043e\u0441\u043b\u0430\u043d\u043e \
    \u0440\u0430\u043d\u0435\u0435 \u043d\u0430\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u043e\u0433\u043e \u043f\u0430\u043a\u0435\u0442\u0443 \u0432\u0440\u0435\u043c\u0435\u043d\u0438
enableIncomingRtp#description \u0415\u0441\u043b\u0438 <b>false</b> \u0442\u043e\u0433\u0434\u0430 \u0442\u0435\u0440\u043c\u0438\u043d\u0430\u043b \u043d\u0435 \u0431\u0443\u0434\u0435\u0442 \u043e\u0431\u0440\u0430\u0431\u0430\u0442\u044b\u0432\u0430\u0435\u0442 \u0432\u0445\u043e\u0434\u044f\u0449\u0438\u0439 RTP \u043f\u043e\u0442\u043e\u043a.
shareInboundOutboundPort#description \u0415\u0441\u043b\u0438 <b>true</b> \u0442\u043e\u0433\u0434\u0430 \u0431\u0443\u0434\u0443\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u044b \u043e\u0434\u043d\u0438 \u0438 \u0442\u0435\u0436\u0435 \u043f\u043e\u0440\u0442\u044b \u0434\u043b\u044f \u0432\u0445\u043e\u0434\u044f\u0449\u0435\u0433\u043e \u0438 \
    \u0438\u0441\u0445\u043e\u0434\u044f\u0449\u0435\u0433\u043e RTP/RTPC \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0439