# Copyright 2012 Mikhail Titov.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#      http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

@class \u041f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u0437\u0430\u043f\u0438\u0441\u044b\u0432\u0430\u0442\u044c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u044b \u0441\u043a\u043e\u043c\u043c\u0443\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0435 \u043f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 IvrConversationsBridgeManagerNode
@class#description \u041f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u0437\u0430\u043f\u0438\u0441\u044b\u0432\u0430\u0442\u044c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u044b \u0441\u043a\u043e\u043c\u043c\u0443\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0435 \u043f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 IvrConversationsBridgeManagerNode. \
    \u0414\u043b\u044f \u0442\u043e\u0433\u043e \u0447\u0442\u043e\u0431\u044b \u0437\u0430\u0440\u0430\u0431\u043e\u0442\u0430\u043b\u043e \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e:\
    <ul>\
    <li>\u0423\u043a\u0430\u0437\u0430\u0442\u044c \u043c\u043e\u0441\u0442 (<b>conversationBridgeManager</b>) \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0434\u043e\u043b\u0436\u043d\u0430 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0442\u044c\u0441\u044f \u0437\u0430\u043f\u0438\u0441\u044c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u043e\u0432</li>\
    <li>\u0423\u043a\u0430\u0437\u0430\u0442\u044c \u043a\u0430\u0442\u0430\u043b\u043e\u0433 (<b>baseDir</b>) \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0431\u0443\u0434\u0443\u0442 \u0445\u0440\u0430\u043d\u0438\u0442\u044c\u0441\u044f \u0437\u0430\u043f\u0438\u0441\u0438 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u043e\u0432</li>\
    <li>\u0415\u0441\u043b\u0438 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f \u0437\u0430\u0434\u0430\u0442\u044c \u0444\u0438\u043b\u044c\u0442\u0440 (<b>filterExpression</b>). \u0417\u0430\u043f\u0438\u0441\u044b\u0432\u0430\u0442\u044c\u0441\u044f \u0431\u0443\u0434\u0443\u0442 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0435 \
        \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u044b \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0443\u0434\u043e\u0432\u043b\u0435\u0442\u0432\u043e\u0440\u044f\u044e\u0442 \u0444\u0438\u043b\u044c\u0442\u0440\u0443</li>\
    <li>\u0417\u0430\u0434\u0430\u0442\u044c \u0448\u0430\u0431\u043b\u043e\u043d \u0438\u043c\u0435\u043d\u0438 \u0444\u0430\u0439\u043b\u0430 (<b>fileNameExpression</b>). \u041f\u043e \u044d\u0442\u043e\u043c\u0443 \u0448\u0430\u0431\u043b\u043e\u043d\u0443 \u0431\u0443\u0434\u0435\u0442 \
        \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0438\u043c\u044f \u0444\u0430\u0439\u043b\u0430</li>\
    <li>\u0415\u0441\u043b\u0438 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e, \u0447\u0442\u043e\u0431\u044b \u043f\u043e\u0441\u043b\u0435 \u0437\u0430\u043f\u0438\u0441\u0438 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430 \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043b\u0430\u0441\u044c \u0437\u0430\u043f\u0438\u0441\u044c \u0441 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0435\u0439 \u043e \
        \u0437\u0430\u043f\u0438\u0441\u0430\u043d\u043d\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435, \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0437\u0430\u0434\u0430\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0440\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>recordSchema</b></li>\
    <li>\u0415\u0441\u043b\u0438 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0437\u0430\u0434\u0430\u0442\u044c \u0440\u0430\u0441\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u043f\u043e \u043a\u043e\u0442\u043e\u0440\u043e\u043c\u0443 \u0431\u0443\u0434\u0443\u0442 \u0443\u0434\u0430\u043b\u044f\u0442\u044c\u0441\u044f "\u0441\u0442\u0430\u0440\u044b\u0435" \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u044b. \
        \u0414\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0437\u0430\u0434\u0430\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0441\u0432\u043e\u0439\u0441\u0442\u0432: <b>cleanupScheduler, keepRecordsForDays</b></li>\
    </ul>

conversationBridgeManager#description \u041c\u043e\u0441\u0442 \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0434\u043e\u043b\u0436\u043d\u0430 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0442\u044c\u0441\u044f \u0437\u0430\u043f\u0438\u0441\u044c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u043e\u0432
baseDir#description \u041a\u0430\u0442\u0430\u043b\u043e\u0433 \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0431\u0443\u0434\u0443\u0442 \u0445\u0440\u0430\u043d\u0438\u0442\u044c\u0441\u044f \u0437\u0430\u043f\u0438\u0441\u0438 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u043e\u0432. \u0421\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0430 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u043e\u0432 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0430\u044f: \
    <i>baseDir / yyyy.MM / dd / \u0438\u043c\u044f_\u0444\u0430\u0439\u043b\u0430.wav<i> 
executor#description \u0418\u0441\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044c, \u0440\u0435\u0441\u0443\u0440\u0441\u044b \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0431\u0443\u0434\u0443\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u044b \u0434\u043b\u044f \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u0430\u0441\u0438\u043d\u0445\u0440\u043e\u043d\u043d\u044b\u0445 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0439
filterExpression#description \u0417\u0430\u043f\u0438\u0441\u044b\u0432\u0430\u0442\u044c\u0441\u044f \u0431\u0443\u0434\u0443\u0442 \u0442\u043e\u043b\u044c\u043a\u043e \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u044b, \u0443\u0434\u043e\u0432\u043b\u0435\u0442\u0432\u043e\u0440\u044f\u044e\u0449\u0438\u0435 \u0434\u0430\u043d\u043d\u043e\u043c\u0443 \u0444\u0438\u043b\u044c\u0442\u0440\u0443.\
    \u041f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u043a\u043e\u043d\u0435\u043a\u0441\u0442\u0430 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f:\
    <ul>\
    <li><b>c1NumA</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u0441 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432\u044b\u0437\u043e\u0432\u043e \u0432 1-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>c1NumB</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u043d\u0430 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432 1-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>c2NumA</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u0441 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432\u044b\u0437\u043e\u0432\u043e \u0432 2-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>c2NumB</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u043d\u0430 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432 2-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>conversation1</b> (org.onesec.raven.ivr.IvrEndpointConversation) - \u0441\u0441\u044b\u043b\u043a\u0430 \u043d\u0430 1-\u044b\u0439 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440</li>\
    <li><b>conversation2</b> (org.onesec.raven.ivr.IvrEndpointConversation) - \u0441\u0441\u044b\u043b\u043a\u0430 \u043d\u0430 2-\u043e\u0439 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440</li>\
    </ul>
fileNameExpression#description \u0428\u0430\u0431\u043b\u043e\u043d \u0438\u043c\u0435\u043d\u0438 \u0444\u0430\u0439\u043b\u0430. \u041f\u043e \u044d\u0442\u043e\u043c\u0443 \u0448\u0430\u0431\u043b\u043e\u043d\u0443 \u0431\u0443\u0434\u0435\u0442 \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0438\u043c\u044f \u0444\u0430\u0439\u043b\u0430. \
    \u041f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u043a\u043e\u043d\u0435\u043a\u0441\u0442\u0430 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f:\
    <ul>\
    <li><b>c1NumA</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u0441 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432\u044b\u0437\u043e\u0432\u043e \u0432 1-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>c1NumB</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u043d\u0430 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432 1-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>c2NumA</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u0441 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432\u044b\u0437\u043e\u0432\u043e \u0432 2-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>c2NumB</b> (String) - \u043d\u043e\u043c\u0435\u0440 \u043d\u0430 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0432 2-\u043e\u043c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435</li>\
    <li><b>conversation1</b> (org.onesec.raven.ivr.IvrEndpointConversation) - \u0441\u0441\u044b\u043b\u043a\u0430 \u043d\u0430 1-\u044b\u0439 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440</li>\
    <li><b>conversation2</b> (org.onesec.raven.ivr.IvrEndpointConversation) - \u0441\u0441\u044b\u043b\u043a\u0430 \u043d\u0430 2-\u043e\u0439 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440</li>\
    <li><b>time</b> (String) - \u0432\u0440\u0435\u043c\u044f \u043d\u0430\u0447\u0430\u043b\u0430 \u0437\u0430\u043f\u0438\u0441\u0438 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430 \u0432 \u0444\u043e\u0440\u043c\u0430\u0442\u0435 HHmmss_S</li>\
    <li><b>date</b> (String) - \u0434\u0430\u0442\u0430 \u043d\u0430\u0447\u0430\u043b\u0430 \u0437\u0430\u043f\u0438\u0441\u0438 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430 \u0432 \u0444\u043e\u0440\u043c\u0430\u0442\u0435 yyyyMMdd</li>\
    </ul>
keepRecordsForDays#description \u041a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u0434\u043d\u0435\u0439 \u0447\u0435\u0440\u0435\u0437 \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u0437\u0430\u043f\u0438\u0441\u044c \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430 \u0431\u0443\u0434\u0435\u0442 \u0443\u0434\u0430\u043b\u0435\u043d\u0430. \u0420\u0430\u0431\u043e\u0442\u0430\u0435\u0442 \
    \u0442\u043e\u043b\u044c\u043a\u043e \u0432 \u0442\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u0435\u0441\u043b\u0438 \u0435\u0441\u043b\u0438 \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 (<b>cleanupSchedule</b>)
cleanupScheduler#description \u0420\u0430\u0441\u043f\u0438\u0441\u0430\u043d\u0438\u0435, \u0437\u0430\u043f\u0443\u0441\u043a\u0430\u044e\u0449\u0435\u0435 \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u0443\u0434\u0430\u043b\u0435\u043d\u0438\u044f "\u0441\u0442\u0430\u0440\u044b\u0445" \u0444\u0430\u0439\u043b\u043e\u0432 (\u0441\u043c. <b>keepRecordsForDays</b>).
noiseLevel#description \u0421\u0438\u0433\u043d\u0430\u043b \u043d\u0438\u0436\u0435 \u0434\u0430\u043d\u043d\u043e\u0433\u043e \u0443\u0440\u043e\u0432\u043d\u044f \u0431\u0443\u0434\u0435\u0442 \u0441\u0447\u0438\u0442\u0430\u0442\u044c\u0441\u044f \u0448\u0443\u043c\u043e\u043c
maxGainCoef#description \u041c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u044b\u0439 \u043a\u043e\u044d\u0444\u0438\u0446\u0438\u0435\u043d\u0442 \u0443\u0441\u0438\u043b\u0435\u043d\u0438\u044f \u0441\u0438\u0433\u043d\u0430\u043b\u0430

callInfoMessage \u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043e \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0435
recordStartTimeMessage \u0414\u0430\u0442\u0430/\u0432\u0440\u0435\u043c\u044f \u043d\u0430\u0447\u0430\u043b\u0430 \u0437\u0430\u043f\u0438\u0441\u0438 \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440\u0430
recordDurationMessage \u041f\u0440\u043e\u0434\u043e\u043b\u0436\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u044c \u0437\u0430\u043f\u0438\u0441\u0438 (\u0441\u0435\u043a)
recordFileMessage \u0424\u0430\u0439\u043b\u0430 \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0437\u0430\u043f\u0438\u0441\u044b\u0432\u0430\u0442\u0435\u0441\u044f \u0440\u0430\u0437\u0433\u043e\u0432\u043e\u0440