#  Copyright 2010 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0445 \u0432\u044B\u0437\u043E\u0432\u043E\u0432 \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u043F\u043E \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u043C\u0443 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u044E.
@class#description \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0445 \u0432\u044B\u0437\u043E\u0432\u043E\u0432 \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u043F\u043E \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u043C\u0443 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u044E.

rtpStreamManager#description \u041C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 RTP \u043F\u043E\u0442\u043E\u043A\u043E\u0432
address#description \u0410\u0434\u0440\u0435\u0441\u0441 (\u043D\u043E\u043C\u0435\u0440) \u0442\u0435\u0440\u043C\u0438\u043D\u0430\u043B\u0430
executorService#description \u0421\u0435\u0440\u0432\u0438\u0441 \u043F\u0440\u0438 \u043F\u043E\u043C\u043E\u0449\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0442\u0435\u0440\u043C\u0438\u043D\u0430\u043B \u0431\u0443\u0434\u0435\u0442 \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u0442\u044C \u0430\u0441\u0438\u043D\u0445\u0440\u043E\u043D\u043D\u044B\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F
conversationScenario#description \u0421\u0446\u0435\u043D\u0430\u0440\u0438\u0439 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D \u0432 \u0442\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u0435\u0441\u043B\u0438 \
    \u043D\u0430 \u0442\u0435\u0440\u043C\u0438\u043D\u0430\u043B \u043F\u0440\u0438\u0434\u0435\u0442 \u0432\u044B\u0437\u043E\u0432
codec#description \u041A\u043E\u0434\u0435\u043A \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u0431\u0443\u0434\u0443\u0442 \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0430\u0443\u0434\u0438\u043E \u0434\u0430\u043D\u043D\u044B\u0435
rtpPacketSize#description \u0420\u0430\u0437\u043C\u0435\u0440 rtp \u043F\u0430\u043A\u0435\u0442\u0430 \u0432 \u0431\u0438\u0442\u0430\u0445. \u0414\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F: 160, 240, 320. \
    \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u043E \u0442\u043E\u0433\u0434\u0430 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0440\u0430\u0437\u043C\u0435\u0440\u0430 \u043F\u0430\u043A\u0435\u0442\u0430 \u0431\u0443\u0434\u0435\u0442 \u0431\u0440\u0430\u0442\u044C\u0441\u044F \u0440\u0430\u0437\u043C\u0435\u0440 \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0439 CCM.
rtpInitialBuffer#description \u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E rtp \u043F\u0430\u043A\u0435\u0442\u043E\u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0431\u0443\u0434\u0435\u0442 \u043F\u043E\u043C\u0435\u0449\u0435\u043D\u043E \u0432 \u0431\u0443\u0444\u0435\u0440 \u0434\u043E \u043F\u043E\u0441\u044B\u043B\u043A\u0438 \u043F\u0435\u0440\u0432\u043E\u0433\u043E rtp \u043F\u0430\u043A\u0435\u0442\u0430.
rtpMaxSendAheadPacketsCount#description \u041C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043F\u0430\u043A\u0435\u0442\u043E\u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043E\u0442\u043E\u0441\u043B\u0430\u043D\u043E \
    \u0440\u0430\u043D\u0435\u0435 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u043D\u043E\u0433\u043E \u043F\u0430\u043A\u0435\u0442\u0443 \u0432\u0440\u0435\u043C\u0435\u043D\u0438

callIdColumnMessage \u0418\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440 \u0432\u044B\u0437\u043E\u0432\u0430
callInfoColumnMessage \u0414\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F \u043E \u0432\u044B\u0437\u043E\u0432\u0435
callsCountMessage  <b>\u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u0430\u043D\u043D\u044B\u0445 \u0432\u044B\u0437\u043E\u0432\u043E\u0432: </b>%s