#  Copyright 2010 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0414\u0435\u0439\u0441\u0442\u0432\u0438\u0435, \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0435\u0435 \u043E\u0442\u043B\u043E\u0436\u0438\u0442\u044C \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 DTMF \u0434\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u0439 \u0442\u043E\u0447\u043A\u0438 \u0432 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u0438
@class#description \u0414\u0435\u0439\u0441\u0442\u0432\u0438\u0435, \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0435\u0435 \u043E\u0442\u043B\u043E\u0436\u0438\u0442\u044C \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 DTMF \u0434\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u0439 \u0442\u043E\u0447\u043A\u0438 \u0432 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u0438. \
    \u0420\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u044D\u0442\u043E \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C:\
    <ul>\
        <li>C\u0446\u0435\u043D\u0430\u0440\u0438\u0439 \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442 \u0440\u0430\u0431\u043E\u0442\u0443</li>\
        <li>\u0415\u0441\u043B\u0438 \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u044F \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442 DTMF \u0438 \u043E\u043D \u0432\u0445\u043E\u0434\u0438\u0442 \u0432 \u043D\u0430\u0431\u043E\u0440 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432, \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0445 \u0432 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0435 \
            <b>dtmfs</b>, \u0442\u043E\u0433\u0434\u0430 \u0440\u0430\u0431\u043E\u0442\u0430 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u044F \u043D\u0435 \u043E\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0430 DTMF \u043D\u0430\u043A\u0430\u043F\u043B\u0438\u0432\u0430\u0435\u0442\u0441\u044F</li>\
        <li>\u041A\u0430\u043A \u0442\u043E\u043B\u044C\u043A\u043E \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u0439 \u0434\u043E\u0445\u043E\u0434\u0438\u0442 \u0434\u043E \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u043D\u0430\u043A\u043E\u043F\u043B\u0435\u043D\u043D\u044B\u0435 DTMF \u043A\u043E\u043F\u0438\u0440\u0443\u044E\u0442\u0441\u044F \u0432 \
            \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0443\u044E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F <b>dtmfs</b></li>\
        <li>\u0412\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u044F \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0430\u0435\u0442\u0441\u044F \u0441 \u043D\u0430\u0447\u0430\u043B\u0430 \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0442\u043E\u0447\u043A\u0438 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u044F</li>\
    </ul>

dtmfs#description \u0421\u0438\u043C\u0432\u043E\u043B\u044B DTMF \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u043E \u0434\u043E\u0441\u0442\u0438\u0436\u0435\u043D\u0438\u044E \u0442\u043E\u0447\u043A\u0438 \u0432 \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u0438 \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \
    \u0434\u0430\u043D\u043D\u044B\u0439 \u0443\u0437\u0435\u043B. 