# Copyright 2013 Mikhail Titov.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#      http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

@class \u041e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u0435\u0442 \u043d\u0430\u0431\u043e\u0440 \u0444\u0440\u0430\u0437, \u0441\u043e\u0441\u0442\u043e\u044f\u0449\u0438\u0439 \u0438\u0437 \u0441\u043b\u043e\u0432, \u0447\u0438\u0441\u0435\u043b, \u0441\u0443\u043c\u043c \u0438 \u043f\u0430\u0443\u0437.
@class#description \u041e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u0435\u0442 \u043d\u0430\u0431\u043e\u0440 \u0444\u0440\u0430\u0437, \u0441\u043e\u0441\u0442\u043e\u044f\u0449\u0438\u0439 \u0438\u0437 \u0441\u043b\u043e\u0432, \u0447\u0438\u0441\u0435\u043b, \u0441\u0443\u043c\u043c \u0438 \u043f\u0430\u0443\u0437. \u0414\u0435\u043b\u0430\u0435\u0442\u0441\u044f \u044d\u0442\u043e \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
    <ul>\
    <li>\u041d\u0430\u0431\u043e\u0440 \u0444\u0440\u0430\u0437 \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0435 \u0441\u0442\u0440\u043e\u043a\u0438 (<b>actionsSequence</b>) \u0441\u043e\u0441\u0442\u043e\u044f\u0449\u0435\u0439 \u0438\u0437 \u043a\u043e\u043c\u0430\u043d\u0434, \u0440\u0430\u0437\u0434\u0435\u043b\u0435\u043d\u043d\u044b\u0445 \
        \u043f\u0440\u043e\u0431\u0435\u043b\u044c\u043d\u044b\u043c \u0441\u0438\u043c\u0432\u043e\u043b\u043e\u043c. \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0441\u0442\u0440\u043e\u043a\u0430<br>\
        ^\u043f\u0440\u0438\u0432\u0435\u0442 @1s #1<br>\
        \u0441\u043e\u0441\u0442\u043e\u0438\u0442 \u0438\u0437 \u043a\u043e\u043c\u0430\u043d\u0434: \
          <ol>\
          <li>\u043f\u0440\u043e\u0438\u0433\u0440\u0430\u0442\u044c \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u0441 \u0438\u043c\u0435\u043d\u0435\u043c <b>\u043f\u0440\u0438\u0432\u0435\u0442</b>\
          <li>\u0441\u0434\u0435\u043b\u0430\u0442\u044c <b>\u043f\u0430\u0443\u0437\u0443 \u0432 1 \u0441\u0435\u043a\u0443\u043d\u0434\u0443</b>\
          <li>\u043e\u0437\u0432\u0443\u0447\u0438\u0442\u044c <b>\u0447\u0438\u0441\u043b\u043e 1</b>\
          </ol>\
    <li>\u041f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044e\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0435 \u043a\u043e\u043c\u0430\u043d\u0434\u044b: \
        <ul>\
        <li><b>\u041f\u0430\u0443\u0437\u0430</b> - \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: <b>@NUM[s]</b><br>\
             \u0413\u0434\u0435 <b>NUM</b> - \u0447\u0438\u0441\u043b\u043e, \u043f\u0430\u0443\u0437\u0443 \u0432 \u043c\u0438\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 \u0438\u043b\u0438 \u0432 \u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 \u0435\u0441\u043b\u0438 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0441\u0443\u0444\u0438\u043a\u0441 <b>s</b>\
        <li><b>\u041e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u043d\u0438\u0435 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430</b> - \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: <b>^[wp=P1[s];n=N1[,N2,..]:]\u0418\u041c\u042f1[,\u0418\u041c\u042f2,...]</b><br>\
             \u0413\u0434\u0435: \
             <ul>\
             <li><b>wp=P1[s]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u043f\u0430\u0443\u0437\u0443 \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 (\u0438\u043b\u0438 \u0432 \u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445, \u0435\u0441\u043b\u0438 \u0443\u043a\u0430\u0437\u0430\u043d \u0441\u0443\u0444\u0438\u043a\u0441 s) \u043c\u0435\u0436\u0434\u0443 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u0435\u043c\u044b\u043c\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0430\u043c\u0438.<br>\
                 \u0415\u0441\u043b\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0434\u0430\u043d\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e, \u0442\u043e\u0433\u0434\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>wordsWordPause</b>\
                 <b>\u0412\u0430\u0436\u043d\u043e!<b> \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0438 \u043e\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u043c. \u0412 \u044d\u0442\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u0441\u043b\u043e\u0432\u0430 \u0431\u0443\u0434\u0443\u0442, \u043a\u0430\u043a \u0431\u044b, \u043d\u0430\u0435\u0437\u0436\u0430\u0442\u044c \u0434\u0440\u0443\u0433 \u043d\u0430 \u0434\u0440\u0443\u0433\u0430\
             <li><b>n=N1[,N2,..]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u0438\u043c\u0435\u043d\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432, \u0443\u043a\u0430\u0437\u044b\u0432\u0430\u044e\u0449\u0438\u0445 \u043d\u0430 \u0443\u0437\u043b\u044b, \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0431\u0443\u0434\u0435\u0442 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u0435\u043d \u043f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u043e\u0432.\
                  <br>\u041f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
                  <ol>\
                  <li>\u0421\u043d\u0430\u0447\u0430\u043b\u0430 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u0438\u0449\u0435\u0442\u0441\u044f \u0432 \u0443\u0437\u043b\u0430\u0445, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0445 \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430\u0445, \u043f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u044b\u0445 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 <n>\
                  <li>\u0415\u0441\u043b\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u043d\u0435 \u043d\u0430\u0448\u0435\u043b\u0441\u044f, \u0442\u043e\u0433\u0434\u0430 \u043f\u043e\u0438\u0441\u043a \u043f\u0440\u043e\u0434\u043e\u043b\u0436\u0430\u0435\u0442\u0441\u044f \u0432 \u0443\u0437\u043b\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c <b>wordsNode</b> \
                  </ol>\
             <li><b>\u0418\u041c\u042f1[,\u0418\u041c\u042f2,...]</b> - \u0438\u043c\u0435\u043d\u0430 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u0435\u043c\u044b\u0445 \u0433\u043e\u043b\u043e\u0441\u043e\u0432\u044b\u0445 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u043e\u0432\
             </ul>\
        <li><b>\u041e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u043d\u0438\u0435 \u0447\u0438\u0441\u043b\u0430</b> - \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
             <br><b>#[sp=P1[s];wp=P2[s];n=N1[,N2,..];g=male|female|neuter;r=R1[,R2,..];z=yes|no:]\u0427\u0418\u0421\u041b\u041e</b><br>\
             \u0413\u0434\u0435: \
             <ul>\
             <li><b>wp=P2[s]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u043f\u0430\u0443\u0437\u0443 \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 (\u0438\u043b\u0438 \u0432 \u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445, \u0435\u0441\u043b\u0438 \u0443\u043a\u0430\u0437\u0430\u043d \u0441\u0443\u0444\u0438\u043a\u0441 s) \u043c\u0435\u0436\u0434\u0443 \u0447\u0438\u0441\u043b\u0430\u043c\u0438, \
                 \u041d\u0430\u043f\u0438\u043c\u0435\u0440 \u0435\u0441\u043b\u0438 \u043e\u0437\u0432\u0443\u0447\u0438\u0442\u044c \u0447\u0438\u0441\u043b\u043e 23, \u043d\u0443\u0436\u043d\u043e \u043f\u0440\u043e\u0433\u0438\u0440\u0430\u0442\u044c \u0434\u0432\u0430 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430: "\u0434\u0432\u0430\u0434\u0446\u0430\u0442\u044c \u0442\u0440\u0438". \
                 \u0414\u0430\u043d\u043d\u044b\u0439 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0437\u0430\u0434\u0430\u0435\u0442 \u043f\u0430\u0443\u0437\u0443 \u043c\u0435\u0436\u0434\u0443 "\u0434\u0432\u0430\u0434\u0446\u0430\u0442\u044c" \u0438 "\u0442\u0440\u0438".<br>\
                 \u0415\u0441\u043b\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0434\u0430\u043d\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e, \u0442\u043e\u0433\u0434\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>numbersWordPause</b>\
                 <b>\u0412\u0430\u0436\u043d\u043e!<b> \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0438 \u043e\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u043c. \u0412 \u044d\u0442\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u0447\u0438\u0441\u043b\u0430 \u0431\u0443\u0434\u0443\u0442, \u043a\u0430\u043a \u0431\u044b, \u043d\u0430\u0435\u0437\u0436\u0430\u0442\u044c \u0434\u0440\u0443\u0433 \u043d\u0430 \u0434\u0440\u0443\u0433\u0430\
             <li><b>sp=P1[s]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u043f\u0430\u0443\u0437\u0443 \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 (\u0438\u043b\u0438 \u0432 \u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445, \u0435\u0441\u043b\u0438 \u0443\u043a\u0430\u0437\u0430\u043d \u0441\u0443\u0444\u0438\u043a\u0441 s) \u043c\u0435\u0436\u0434\u0443 \u0447\u0438\u0441\u043b\u0430\u043c\u0438 \u0435\u0441\u043b\u0438 \u043e\u043d\u0438 \
                 \u0440\u0430\u0437\u0431\u0438\u0442\u044b \u043d\u0430 \u0433\u0440\u0443\u043f\u043f\u044b \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u044b\u043c\u0438 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f\u043c\u0438 \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u043c\u0438 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 <b>r</b>.<br>\
                 \u0415\u0441\u043b\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0434\u0430\u043d\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e, \u0442\u043e\u0433\u0434\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>numbersSentencePause</b>\
             <li><b>n=N1[,N2,..]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u0438\u043c\u0435\u043d\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432, \u0443\u043a\u0430\u0437\u044b\u0432\u0430\u044e\u0449\u0438\u0445 \u043d\u0430 \u0443\u0437\u043b\u044b, \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0431\u0443\u0434\u0435\u0442 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u0435\u043d \u043f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u043e\u0432.\
                  <br>\u041f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
                  <ol>\
                  <li>\u0421\u043d\u0430\u0447\u0430\u043b\u0430 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u0438\u0449\u0435\u0442\u0441\u044f \u0432 \u0443\u0437\u043b\u0430\u0445, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0445 \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430\u0445, \u043f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u044b\u0445 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 <n>\
                  <li>\u0415\u0441\u043b\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u043d\u0435 \u043d\u0430\u0448\u0435\u043b\u0441\u044f, \u0442\u043e\u0433\u0434\u0430 \u043f\u043e\u0438\u0441\u043a \u043f\u0440\u043e\u0434\u043e\u043b\u0436\u0430\u0435\u0442\u0441\u044f \u0432 \u0443\u0437\u043b\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c <b>numbersNode</b> \
                  </ol>\
             <li><b>g=male|female|neuter</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u0440\u043e\u0434 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u043f\u0440\u043e\u0438\u0437\u043d\u043e\u0441\u0438\u0442\u0441\u044f \u0447\u0438\u0441\u043b\u043e. \
                 \u041f\u0440\u0435\u0434\u043f\u043e\u043b\u043e\u0436\u0438\u043c, \u0447\u0442\u043e \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043f\u0440\u043e\u0438\u0437\u043d\u0435\u0441\u0442\u0438  <b>"\u043e\u0434\u043d\u0430 \u0447\u0430\u0448\u043a\u0430"</b>. \u041f\u043e\u0441\u043a\u043e\u043b\u044c\u043a\u0443 \u0441\u043b\u043e\u0432\u043e "\u0447\u0430\u0448\u043a\u0430" \u0436\u0435\u043d\u0441\u043a\u043e\u0433\u043e \
                 \u0440\u043e\u0434\u0430 \u043d\u0443\u0436\u043d\u043e \u043f\u0440\u043e\u0438\u0437\u043d\u0435\u0441\u0442\u0438 "\u043e\u0434\u043d\u0430" (1'), \u0435\u0441\u043b\u0438 \u0431\u044b \u043d\u0430\u043c \u043d\u0443\u0436\u043d\u043e \u0431\u044b\u043b\u043e  \u043f\u0440\u043e\u0438\u0437\u043d\u0435\u0441\u0442\u0438 <b>"\u043e\u0434\u043d\u043e \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0435"</b>, \
                 \u0442\u043e \u043f\u043e\u0441\u043a\u043e\u043b\u044c\u043a\u0443 "\u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0435" \u0441\u0440\u0435\u0434\u043d\u0435\u0433\u043e \u0440\u043e\u0434\u0430, \u043d\u0443\u0436\u043d\u043e \u043f\u0440\u043e\u0438\u0437\u043d\u0435\u0441\u0442\u0438 "\u043e\u0434\u043d\u043e" (1'')\
             <li><b>r=R1[,R2,..]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u043d\u0430\u0431\u043e\u0440 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u044b\u0445 \u0432\u044b\u0440\u0430\u0436\u0430\u0435\u043d\u0438\u0439, \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0449\u0438\u0439 \u0440\u0430\u0437\u0431\u0438\u0442\u044c \u0447\u0438\u0441\u043b\u043e \u043d\u0430 \u0433\u0440\u0443\u043f\u043f\u044b. \
                 \u0427\u0418\u0421\u041b\u041e \u043f\u043e\u0441\u043b\u0435\u0434\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043f\u0440\u043e\u0432\u0435\u0440\u044f\u0435\u0442\u0441\u044f \u043d\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0441\u0442\u0432\u0438\u0435 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u044b\u043c \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f\u0435\u043c \u0438\u0437 \u0441\u043f\u0438\u0441\u043a\u0430. \
                 \u0415\u0441\u043b\u0438 \u0441\u043e\u043e\u0442\u0432\u0435\u0441\u0442\u0432\u0438\u0435 \u043d\u0430\u0439\u0434\u0435\u043d\u043e, \u0442\u043e\u0433\u0434\u0430 \u0438\u0437 \u0433\u0440\u0443\u043f\u043f \u0437\u0430\u0445\u0432\u0430\u0447\u0435\u043d\u043d\u044b\u0445 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u044b\u043c \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435\u043c \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u0441\u043f\u0438\u0441\u043e\u043a \
                 \u0447\u0438\u0441\u0435\u043b \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0431\u0443\u0434\u0443\u0442 \u043e\u0437\u0432\u0443\u0447\u0435\u043d\u044b. \
                 <br>\u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0435\u0441\u043b\u0438 \u0438\u043c\u0435\u0435\u0442 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 <b>#r=(\d\d)(\d\d):1234</b>, \u0442\u043e\u0433\u0434\u0430 \u0447\u0438\u0441\u043b\u043e \u0440\u0430\u0437\u043e\u0431\u044c\u0435\u0442\u0441\u044f \u043d\u0430 \u0433\u0440\u0443\u043f\u043f\u044b \
                 12 \u0438 34.\
                 <br><b style='color:red'>\u0412\u0430\u0436\u043d\u043e!</b> \u0435\u0441\u043b\u0438 \u0432 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 \u043f\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0445\u043e\u0442\u044f \u0431\u044b \u043e\u0434\u043d\u043e \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u043e\u0435 \u0432\u044b\u0440\u0436\u0435\u043d\u0438\u0435 \u0438 \
                 \u0427\u0418\u0421\u041b\u041e \u043d\u0435 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043d\u0438 \u043e\u0434\u043d\u043e\u043c\u0443 \u0438\u0437 \u043d\u0438\u0445 \u0442\u043e\u0433\u0434\u0430 \u0427\u0418\u0421\u041b\u041e \u043f\u0440\u043e\u0438\u0437\u043d\u043e\u0441\u0438\u0442\u0441\u044f \u043d\u0435 \u0431\u0443\u0434\u0435\u0442! \
             <li><b>z=yes|no</b> - \u0435\u0441\u043b\u0438 <b>yes</b> \u0442\u043e\u0433\u0434\u0430 \u0447\u0438\u0441\u043b\u043e \u043d\u043e\u043b\u044c \u0431\u0443\u0434\u0435\u0442 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u0442\u044c\u0441\u044f. \u0415\u0441\u043b\u0438 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u043d\u0435 \u0443\u043a\u0430\u0437\u0430\u043d, \
                 \u0442\u043e\u0433\u0434\u0430 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 <b>numbersEnableZero</b> \
             <li><b>\u0427\u0418\u0421\u041b\u041e</b> - \u0447\u0438\u0441\u043b\u043e \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043e\u0437\u0432\u0443\u0447\u0438\u0442\u044c.\
             </ul>\
        <li><b>\u041e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u043d\u0438\u0435 \u0441\u0443\u043c\u043c\u044b</b> - \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
             <br><b>$[wp=P1[s];n=N1[,N2,..]:]XXXX.XX</b><br>\
             \u0413\u0434\u0435: \
             <ul>\
             <li><b>wp=P2[s]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u043f\u0430\u0443\u0437\u0443 \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 (\u0438\u043b\u0438 \u0432 \u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445, \u0435\u0441\u043b\u0438 \u0443\u043a\u0430\u0437\u0430\u043d \u0441\u0443\u0444\u0438\u043a\u0441 s) \u043c\u0435\u0436\u0434\u0443 \u0447\u0438\u0441\u043b\u0430\u043c\u0438, \
                 \u041d\u0430\u043f\u0438\u043c\u0435\u0440 \u0435\u0441\u043b\u0438 \u043e\u0437\u0432\u0443\u0447\u0438\u0442\u044c c\u0443\u043c\u043c\u0443 "23 \u0440\u0443\u0431\u043b\u044f", \u043d\u0443\u0436\u043d\u043e \u043f\u0440\u043e\u0433\u0438\u0440\u0430\u0442\u044c \u0442\u0440\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430: "\u0434\u0432\u0430\u0434\u0446\u0430\u0442\u044c \u0442\u0440\u0438 \u0440\u0443\u0431\u043b\u044f". \
                 \u0414\u0430\u043d\u043d\u044b\u0439 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0437\u0430\u0434\u0430\u0435\u0442 \u043f\u0430\u0443\u0437\u0443 \u043c\u0435\u0436\u0434\u0443 \u044d\u0442\u0438\u043c\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430\u043c\u0438.<br>\
                 \u0415\u0441\u043b\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0434\u0430\u043d\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e, \u0442\u043e\u0433\u0434\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>amountWordPause</b>\
                 <b>\u0412\u0430\u0436\u043d\u043e!<b> \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0438 \u043e\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u043c. \u0412 \u044d\u0442\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u0447\u0438\u0441\u043b\u0430 \u0431\u0443\u0434\u0443\u0442, \u043a\u0430\u043a \u0431\u044b, \u043d\u0430\u0435\u0437\u0436\u0430\u0442\u044c \u0434\u0440\u0443\u0433 \u043d\u0430 \u0434\u0440\u0443\u0433\u0430\
             <li><b>n=N1[,N2,..]</b> - \u0437\u0430\u0434\u0430\u0435\u0442 \u0438\u043c\u0435\u043d\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432, \u0443\u043a\u0430\u0437\u044b\u0432\u0430\u044e\u0449\u0438\u0445 \u043d\u0430 \u0443\u0437\u043b\u044b, \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0431\u0443\u0434\u0435\u0442 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u0435\u043d \u043f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u043e\u0432.\
                  <br>\u041f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
                  <ol>\
                  <li>\u0421\u043d\u0430\u0447\u0430\u043b\u0430 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u0438\u0449\u0435\u0442\u0441\u044f \u0432 \u0443\u0437\u043b\u0430\u0445, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0445 \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430\u0445, \u043f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u044b\u0445 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 <n>\
                  <li>\u0415\u0441\u043b\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u043d\u0435 \u043d\u0430\u0448\u0435\u043b\u0441\u044f, \u0442\u043e\u0433\u0434\u0430 \u043f\u043e\u0438\u0441\u043a \u043f\u0440\u043e\u0434\u043e\u043b\u0436\u0430\u0435\u0442\u0441\u044f \u0432 \u0443\u0437\u043b\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c <b>amountWordPause</b> \
                  </ol>\
             <li><b>XXXX.XX</b> - \u0441\u0443\u043c\u043c\u0430. \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 23.10 - \u043e\u0437\u043d\u0430\u0447\u0430\u0435\u0442 23 \u0440\u0443\u0431\u043b\u044f 10 \u043a\u043e\u043f\u0435\u0435\u043a\
             </ul>\
        </ul>\
    </ul>\ 

wordsNode#description \u0417\u0430\u0434\u0430\u0435\u0442 \u0443\u0437\u0435\u043b \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0445\u0440\u0430\u043d\u044f\u0442\u0441\u044f \u0433\u043e\u043b\u043e\u0441\u043e\u0432\u044b\u0435 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u044b, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u043c\u044b\u0435 \u043f\u0440\u0438 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u043d\u0438\u0438 \u0441\u043b\u043e\u0432 \
    (\u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f \u0442\u0438\u043f\u0430 <b>^word</b>). \
    <b>\u0412\u043d\u0438\u043c\u0430\u043d\u0438\u0435!</b> \u041c\u043e\u0436\u043d\u043e \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432 \u043d\u0430\u0447\u0438\u043d\u0430\u044e\u0449\u0438\u0445\u0441 \u0441 <b>wordsNode</b> \u0438 \u0437\u0430\u043a\u0430\u043d\u0447\u0438\u0432\u0430\u044e\u0449\u0438\u0445\u0441\u044f \u0447\u0438\u0441\u043b\u043e\u043c. \
    \u0422\u043e\u0433\u0434\u0430 \u043f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430 \u0431\u0443\u0434\u0435\u0442 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0442\u044c\u0441\u044f \u0441\u043d\u0430\u0447\u0430\u043b\u0430 \u0432 \u0443\u0437\u043b\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e\u043c \u0432 <b>wordsNode</b> \u0437\u0430\u0442\u0435\u043c <b>wordsNode1</b> \
    \u0438 \u0442\u0430\u043a \u0434\u0430\u043b\u0435\u0435
numbersNode#description \u0417\u0430\u0434\u0430\u0435\u0442 \u0443\u0437\u0435\u043b \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0445\u0440\u0430\u043d\u044f\u0442\u0441\u044f \u0433\u043e\u043b\u043e\u0441\u043e\u0432\u044b\u0435 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u044b, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u043c\u044b\u0435 \u043f\u0440\u0438 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u043d\u0438\u0438 \u0447\u0438\u0441\u0435\u043b \
    (\u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f \u0442\u0438\u043f\u0430 <b>#number</b>). \
    <b>\u0412\u043d\u0438\u043c\u0430\u043d\u0438\u0435!</b> \u041c\u043e\u0436\u043d\u043e \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432 \u043d\u0430\u0447\u0438\u043d\u0430\u044e\u0449\u0438\u0445\u0441 \u0441 <b>numbersNode</b> \u0438 \u0437\u0430\u043a\u0430\u043d\u0447\u0438\u0432\u0430\u044e\u0449\u0438\u0445\u0441\u044f \u0447\u0438\u0441\u043b\u043e\u043c. \
    \u0422\u043e\u0433\u0434\u0430 \u043f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430 \u0431\u0443\u0434\u0435\u0442 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0442\u044c\u0441\u044f \u0441\u043d\u0430\u0447\u0430\u043b\u0430 \u0432 \u0443\u0437\u043b\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e\u043c \u0432 <b>numbersNode</b> \u0437\u0430\u0442\u0435\u043c <b>numbersNode1</b> \
    \u0438 \u0442\u0430\u043a \u0434\u0430\u043b\u0435\u0435
amountNumbersNode#description \u0417\u0430\u0434\u0430\u0435\u0442 \u0443\u0437\u0435\u043b \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0445\u0440\u0430\u043d\u044f\u0442\u0441\u044f \u0433\u043e\u043b\u043e\u0441\u043e\u0432\u044b\u0435 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u044b, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u043c\u044b\u0435 \u043f\u0440\u0438 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u043d\u0438\u0438 \u0441\u0443\u043c\u043c \
    (\u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f \u0442\u0438\u043f\u0430 <b>$amount</b>). \
    <b>\u0412\u043d\u0438\u043c\u0430\u043d\u0438\u0435!</b> \u041c\u043e\u0436\u043d\u043e \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432 \u043d\u0430\u0447\u0438\u043d\u0430\u044e\u0449\u0438\u0445\u0441 \u0441 <b>amountNumbersNode</b> \u0438 \u0437\u0430\u043a\u0430\u043d\u0447\u0438\u0432\u0430\u044e\u0449\u0438\u0445\u0441\u044f \u0447\u0438\u0441\u043b\u043e\u043c. \
    \u0422\u043e\u0433\u0434\u0430 \u043f\u043e\u0438\u0441\u043a \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430 \u0431\u0443\u0434\u0435\u0442 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0442\u044c\u0441\u044f \u0441\u043d\u0430\u0447\u0430\u043b\u0430 \u0432 \u0443\u0437\u043b\u0435 \u0437\u0430\u0434\u0430\u043d\u043d\u043e\u043c \u0432 <b>amountNumbersNode</b> \u0437\u0430\u0442\u0435\u043c <b>amountNumbersNode1</b> \
    \u0438 \u0442\u0430\u043a \u0434\u0430\u043b\u0435\u0435
wordsSentencePause#description
wordsWordPause#description  \u041f\u0430\u0443\u0437\u0430 \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 \u043c\u0435\u0436\u0434\u0443 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u0435\u043c\u044b\u043c\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0430\u043c\u0438. \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \
    \u0434\u043b\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0439 \u0442\u0438\u043f\u0430 <b>^word</b> (\u0441\u043c\u043e\u0442\u0440\u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)
numbersGenus#description \u0417\u0430\u0434\u0430\u0435\u0442 \u0440\u043e\u0434 (\u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e) \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u043f\u0440\u043e\u0438\u0437\u043d\u043e\u0441\u0438\u0442\u0441\u044f \u0447\u0438\u0441\u043b\u043e. \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \
    \u0434\u043b\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0439 \u0442\u0438\u043f\u0430 <b>#number</b> (\u0441\u043c\u043e\u0442\u0440\u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)
numbersSentencePause#description \u041f\u0430\u0443\u0437\u0430, \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e, \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 \u043c\u0435\u0436\u0434\u0443 \u0447\u0438\u0441\u043b\u0430\u043c\u0438 \u0435\u0441\u043b\u0438 \u043e\u043d\u0438 \
     \u0440\u0430\u0437\u0431\u0438\u0442\u044b \u043d\u0430 \u0433\u0440\u0443\u043f\u043f\u044b \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u044b\u043c \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f\u043c\u0438.  \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0439 \u0442\u0438\u043f\u0430 <b>#number</b> (\u0441\u043c\u043e\u0442\u0440\u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)
numbersWordPause#description \u041f\u0430\u0443\u0437\u0430, \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e, \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 \u043c\u0435\u0436\u0434\u0443 \u0447\u0438\u0441\u043b\u0430\u043c\u0438. \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0439 \
     \u0442\u0438\u043f\u0430 <b>#number</b> (\u0441\u043c\u043e\u0442\u0440\u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)
numbersEnableZero#description \u0415\u0441\u043b\u0438 <b>TRUE</b> \u0442\u043e\u0433\u0434\u0430 \u0447\u0438\u0441\u043b\u043e \u043d\u043e\u043b\u044c \u0431\u0443\u0434\u0435\u0442 \u043e\u0437\u0432\u0443\u0447\u0438\u0432\u0430\u0442\u044c\u0441\u044f. \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0439 \
     \u0442\u0438\u043f\u0430 <b>#number</b> (\u0441\u043c\u043e\u0442\u0440\u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)
amountWordPause#description \u041f\u0430\u0443\u0437\u0430, \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e, \u0432 \u043c\u0438\u043b\u043b\u0438\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445 \u043c\u0435\u0436\u0434\u0443 \u0447\u0438\u0441\u043b\u0430\u043c\u0438, \
     \u041d\u0430\u043f\u0438\u043c\u0435\u0440 \u0435\u0441\u043b\u0438 \u043e\u0437\u0432\u0443\u0447\u0438\u0442\u044c c\u0443\u043c\u043c\u0443 "23 \u0440\u0443\u0431\u043b\u044f", \u043d\u0443\u0436\u043d\u043e \u043f\u0440\u043e\u0433\u0438\u0440\u0430\u0442\u044c \u0442\u0440\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430: "\u0434\u0432\u0430\u0434\u0446\u0430\u0442\u044c \u0442\u0440\u0438 \u0440\u0443\u0431\u043b\u044f". \
     \u0414\u0430\u043d\u043d\u044b\u0439 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0437\u0430\u0434\u0430\u0435\u0442 \u043f\u0430\u0443\u0437\u0443 \u043c\u0435\u0436\u0434\u0443 \u044d\u0442\u0438\u043c\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430\u043c\u0438. \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0439 \
     \u0442\u0438\u043f\u0430 <b>$amount</b> (\u0441\u043c\u043e\u0442\u0440\u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)
actionsSequence#description \u0421\u0440\u043e\u043a\u0430 \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u044e\u0449\u0430\u044f \u043d\u0430\u0431\u043e\u0440 \u0444\u0440\u0430\u0437, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043e\u0437\u0432\u0443\u0447\u0438\u0442\u044c (\u0441\u043c\u043e\u0442\u0440\u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)