#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0414\u0435\u0439\u0441\u0442\u0432\u0438\u0435, \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0438\u0435 \u043F\u0435\u0440\u0435\u0430\u0434\u0440\u0435\u0441\u043E\u0432\u0430\u0442\u044C \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440 \u043D\u0430 \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440
@class#description \u0414\u0435\u0439\u0441\u0442\u0432\u0438\u0435, \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0438\u0435 \u043F\u0435\u0440\u0435\u0430\u0434\u0440\u0435\u0441\u043E\u0432\u0430\u0442\u044C \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440 \u043D\u0430 \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440

address#description \u041D\u043E\u043C\u0435\u0440 \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u0443\u0434\u0435\u0442 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D \u043F\u0435\u0440\u0435\u0432\u043E\u0434 \u0432\u044B\u0437\u043E\u0432\u0430
monitorTransfer#description \u0415\u0441\u043B\u0438 <b>true</b> \u0442\u043E\u0433\u0434\u0430 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440 \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0441\u0446\u0435\u043D\u0430\u0440\u0438\u044F \u043D\u0435 \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D \u0434\u043E \u0442\u0435\u0445 \
    \u043F\u043E\u0440 \u043F\u043E\u043A\u0430 \u043D\u0435 \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0442\u044C\u0441\u044F \u043F\u0435\u0440\u0435\u0430\u0434\u0440\u0435\u0441\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0432\u044B\u0437\u043E\u0432. \u0414\u043B\u044F \u0442\u043E\u0433\u043E \u0447\u0442\u043E\u0431\u044B \u0434\u0430\u043D\u043D\u0430\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0430\u043B\u0430 \
    \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0447\u0442\u043E\u0431\u044B \u0430\u0434\u0440\u0435\u0441 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u0438\u0440\u043E\u0432\u0430\u043B\u0441\u044F \u043E\u0434\u043D\u0438\u043C \u0438\u0437 \u043F\u0440\u043E\u0432\u0430\u0439\u0434\u0435\u0440\u043E\u0432 \u0441\u0435\u0440\u0432\u0438\u0441\u0430 <b>\u0421\u0421MCallOperatorNode</b>
callStartTimeout#description \u0415\u0441\u043B\u0438 \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 \u044D\u0442\u043E\u0433\u043E \u0432\u0440\u0435\u043C\u0435\u043D\u0438 (\u0432 \u0441\u0435\u043A.) \u043F\u0435\u0440\u0435\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0439 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440 \u043D\u0435 \u0431\u044B\u043B \u0438\u043D\u0438\u0446\u0438\u0440\u043E\u0432\u0430\u043D \
    \u043C\u043E\u043D\u0438\u0442\u043E\u0440\u0438\u043D\u0433 \u043F\u0435\u0440\u0435\u0432\u043E\u0434\u0430 \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D \u0441 \u043E\u0448\u0438\u0431\u043A\u043E\u0439. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0442\u043E\u0433\u0434\u0430 \u043A\u043E\u0433\u0434\u0430 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430
    <i>monitorTransfer</i> - <b>true</b>
callStartTimeout#description \u0415\u0441\u043B\u0438 \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 \u044D\u0442\u043E\u0433\u043E \u0432\u0440\u0435\u043C\u0435\u043D\u0438 (\u0432 \u0441\u0435\u043A.) \u043F\u0435\u0440\u0435\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0439 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440 \u043D\u0435 \u0431\u044B\u043B \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D \
    \u043C\u043E\u043D\u0438\u0442\u043E\u0440\u0438\u043D\u0433 \u043F\u0435\u0440\u0435\u0432\u043E\u0434\u0430 \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D \u0441 \u043E\u0448\u0438\u0431\u043A\u043E\u0439. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0442\u043E\u0433\u0434\u0430 \u043A\u043E\u0433\u0434\u0430 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
    <i>monitorTransfer</i> - <b>true</b>
