# Copyright 2014 Mikhail Titov.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#      http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

@class (DataSource) \u041a\u0430\u043d\u0430\u043b \u043a\u0432\u0438\u0442\u0430\u043d\u0446\u0438\u0439 \u043e \u0434\u043e\u0441\u0442\u0430\u0432\u043a\u0435 SMS \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0439
@class#description (DataSource) \u041a\u0430\u043d\u0430\u043b \u043a\u0432\u0438\u0442\u0430\u043d\u0446\u0438\u0439 \u043e \u0434\u043e\u0441\u0442\u0430\u0432\u043a\u0435 SMS \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0439. \u0414\u043b\u044f \u0442\u043e\u0433\u043e, \u0447\u0442\u043e\u0431\u044b \u0437\u0430\u0440\u0430\u0431\u043e\u0442\u0430\u043b\u043e \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e: \
  <ul> \
  <li>\u0412 \u043d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0430\u0445 SmsTranceiverNode \u0431\u044b\u043b\u043e \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>registeredDelivery</b> (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0432 1) \
      \u0438\u043b\u0438 \u0432 \u0437\u0430\u043f\u0438\u0441\u0438 (record) \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u043e\u043b\u044f <b>needDeliveryReceipt</b> \u0432\u044b\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u043e \u0432 <b>true</b> \
  <li>\u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>bindMode</b> \u0443\u0437\u043b\u0430 SmsTranceiverNode \u0434\u043e\u043b\u0436\u043d\u043e \u0438\u043c\u0435\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 <b>RECEIVER_AND_TRANSMITTER</b> \
      (\u043f\u043e\u0441\u043a\u043e\u043b\u044c\u043a\u0443 \u0443\u0432\u0435\u0434\u043e\u043c\u043b\u0435\u043d\u0438\u0435 \u043e \u0434\u043e\u0441\u0442\u0430\u0432\u043a\u0435 \u043f\u0440\u0438\u0445\u043e\u0434\u0438\u0442 \u043e\u0442 SMSC \u0432 \u0432\u0438\u0434\u0435 \u0437\u0430\u043f\u0440\u043e\u0441\u0430 DELIVERY_SM) \
  <li>\u0417\u0430\u0434\u0430\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>deliveryReceiptSchema</b> (\u044d\u0442\u043e \u0434\u043e\u043b\u0436\u043d\u0430 \u0431\u044b\u0442\u044c \u0441\u0445\u0435\u043c\u0430 \u0442\u0438\u043f\u0430 SmsDeliveryReceiptRecordSchemaNode) \
  <li>\u0415\u0441\u043b\u0438 \u0444\u043e\u0440\u043c\u0430\u0442 \u043a\u0432\u0438\u0442\u0430\u043d\u0446\u0438\u0438 \u043e\u0442\u043b\u0438\u0447\u0430\u0435\u0442\u0441\u044f \u043e\u0442 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u043e\u0439 \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0430\u0446\u0438\u0438, \u0442\u043e\u0433\u0434\u0430 \u043d\u0443\u0436\u043d\u043e \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>pattern</b> \
  </ul>

deliveryReceiptSchema#description \u0421\u0445\u0435\u043c\u0430 \u0437\u0430\u043f\u0438\u0441\u0438 \u0432 \u043a\u043e\u0442\u043e\u0440\u0443\u044e "\u0443\u043f\u0430\u043a\u043e\u0432\u044b\u0432\u0430\u044e\u0442\u0441\u044f" \u0434\u0430\u043d\u043d\u044b\u0435 \u043a\u0432\u0438\u0442\u0430\u043d\u0446\u0438\u0438 \u043e \u0434\u043e\u0441\u0442\u0430\u0432\u043a\u0435 (\u0442\u0438\u043f \u0441\u0445\u0435\u043c\u044b - SmsDeliveryReceiptRecordSchemaNode)
pattern#description \u0420\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u043e\u0435 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 \u043f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u043f\u0430\u0440\u0441\u0438\u0442\u0441\u044f \u043a\u0432\u0438\u0442\u0430\u043d\u0446\u0438\u044f \u043e \u0434\u043e\u0441\u0442\u0430\u0432\u043a\u0435. \
  \u041f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e \u043d\u0430\u0441\u0442\u0440\u043e\u0435\u043d\u043e \u043d\u0430 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 \u0444\u043e\u0440\u043c\u0430\u0442 \u043a\u0432\u0438\u0442\u0430\u043d\u0446\u0438\u0438: \
  <br>id:IIIIIIIIII sub:SSS dlvrd:DDD submit date:YYMMDDhhmm done date:YYMMDDhhmm stat:DDDDDDD err:E Text: . . . . . . . . . \
  <br>\u0412\u0430\u0436\u043d\u043e! \u0418\u043c\u0435\u043d\u0430 capture groups \u0434\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c \u0438\u043c\u0435\u043d\u043d\u043e \u0442\u0430\u043a\u0438\u043c\u0438 \u0438 \u0438\u043c\u0435\u043d\u043d\u043e \u0432 \u0442\u0430\u043a\u043e\u043c \u043a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u0435 \u043a\u0430\u043a \u0432 \u0448\u0430\u0431\u043b\u043e\u043d\u0435 \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e