#  Copyright 2011 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041e\u0447\u0435\u0440\u0435\u0434\u044c \u0434\u043b\u044f \u043f\u043e\u0441\u043b\u0435\u0434\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u043e\u0431\u0441\u043b\u0443\u0436\u0438\u0432\u0430\u043d\u0438\u044f \u0432\u044b\u0437\u043e\u0432\u043e\u0432.
@class#description \u041e\u0447\u0435\u0440\u0435\u0434\u044c \u0434\u043b\u044f \u043f\u043e\u0441\u043b\u0435\u0434\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u043e\u0431\u0441\u043b\u0443\u0436\u0438\u0432\u0430\u043d\u0438\u044f \u0432\u044b\u0437\u043e\u0432\u043e\u0432. \
    \u0420\u0430\u0431\u043e\u0442\u0430\u0435\u0442 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c:\
    <ul>\
    <li>\u0412\u044b\u0437\u043e\u0432 \u043f\u043e\u043f\u0430\u0434\u0430\u0435\u0442 \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u044c</li>\
    <li>\u041f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442 \u0441\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u043a\u0430 \u0432\u044b\u0437\u043e\u0432\u043e\u0432 \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u043f\u043e \u043f\u0440\u0438\u043e\u0440\u0438\u0442\u0435\u0442\u0443 \u0432\u044b\u0437\u043e\u0432\u0430 \u0438 \u0432\u0440\u0435\u043c\u0435\u043d\u0438 \u043f\u043e\u043f\u0430\u0434\u0430\u043d\u0438\u044f \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u044c. \u041c\u0435\u043d\u044c\u0448\u0438\u0435 \
        \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043a\u0430\u043a \u043f\u0440\u0438\u043e\u0440\u0438\u0442\u0435\u0442\u0430 \u0442\u0435\u043c \u0431\u043b\u0438\u0436\u0435 \u0432\u044b\u0437\u043e\u0432 \u043a \u043d\u0430\u0447\u0430\u043b\u0443 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 (\u0431\u044b\u0441\u0442\u0440\u0435\u0435 \u0431\u0443\u0434\u0435\u0442 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u043d \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u043e\u043c). \u0415\u0441\u043b\u0438 \
        \u043f\u0440\u0438\u043e\u0440\u0438\u0442\u0435\u0442\u044b \u043e\u0434\u0438\u043d\u0430\u043a\u043e\u0432\u044b, \u0442\u043e\u0433\u0434\u0430 \u043a\u0442\u043e \u0440\u0430\u043d\u044c\u0448\u0435 \u043f\u043e\u043f\u0430\u043b \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u044c \u0442\u043e\u0442 \u0431\u043b\u0438\u0436\u0435 \u043a \u043d\u0430\u0447\u0430\u043b\u0443 \u043e\u0447\u0435\u0440\u0435\u0434\u0438\
    </li>\
    <li>\u0415\u0441\u043b\u0438 \u0440\u0430\u0437\u043c\u0435\u0440 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u043f\u0440\u0435\u0432\u044b\u0448\u0430\u0435\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u0433\u043e \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <b>maxQueueSize</b> \u0442\u043e\u0433\u0434\u0430 \u0438\u0437 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \
        \u0432\u044b\u0431\u0440\u0430\u0441\u044b\u0432\u0430\u0435\u0442\u0441\u044f \u0432\u044b\u0437\u043e\u0432, \u043d\u0430\u0445\u043e\u0434\u044f\u0449\u0438\u0439\u0441\u044f \u0432 \u043a\u043e\u043d\u0446\u0435 (\u043d\u0435 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u0442\u043e\u0442 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043f\u043e\u0441\u0442\u0443\u043f\u0438\u043b \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u044c)</li>\
    <li>\u0414\u0430\u043b\u0435\u0435 \u0438\u0437 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u0432\u044b\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044f \u0432\u044b\u0437\u043e\u0432 (\u043f\u0435\u0440\u0432\u044b\u0439 \u0438\u0437 \u0441\u043f\u0438\u0441\u043a\u0430)</li>\
    <li>\u041e\u0447\u0435\u0440\u0435\u0434\u044c \u043f\u043e \u043f\u0440\u0438\u043e\u0440\u0438\u0442\u0435\u0442\u0443 \u0432\u044b\u0437\u043e\u0432\u0430 \u043e\u043f\u0440\u0435\u0434\u0435\u044f\u0435\u0442 <b>priority selector node</b> (CallsQueuePrioritySelectorNode). \
        \u041e\u043f\u0440\u0435\u0434\u0435\u043b\u044f\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \u0432\u044b\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044f \u0431\u043b\u0438\u0436\u0430\u0439\u0448\u0438\u0439 (\u0432 \u0441\u0442\u043e\u0440\u043e\u043d\u0443 \u0443\u043c\u0435\u043d\u044c\u0448\u0435\u043d\u0438\u044f \u043f\u0440\u0438\u043e\u0440\u0438\u0442\u0435\u0442\u0430) <b>selector</b> \
        \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <i>priority</i> \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0431\u043e\u043b\u044c\u0448\u0435 \u0438\u043b\u0438 \u0440\u0430\u0432\u043d\u0430 <i>\u043f\u0440\u0438\u043e\u0440\u0438\u0442\u0435\u0442\u0443 \u0432\u044b\u0437\u043e\u0432\u0430</i>.\
        <br/>\u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440\
        <ul>\
            <li>\u041f\u0443\u0441\u0442\u044c \u0438\u043c\u0435\u044e\u0442\u0441\u044f \u0434\u0432\u0430 <b>selector</b>: s1 (priority=0), s2 (priority=10)</li>\
            <li>\u0422\u043e\u0433\u0434\u0430 \u0434\u043b\u044f \u0432\u044b\u0437\u043e\u0432\u043e\u0432 \u0441 \u043f\u0440\u0438\u043e\u0440\u0438\u0442\u0435\u0442\u043e\u043c \u043e\u0442 0 \u0434\u043e 9 \u0431\u0443\u0434\u0435\u0442 \u0432\u044b\u0431\u0440\u0430\u043d <b>selector</b> s1, \u0430 \u0434\u043b\u044f \u043e\u0441\u0442\u0430\u043b\u044c\u043d\u044b\u0445 s2</li>\
        </ul>\
    </li>\
    <li>\u0417\u0430\u0442\u0435\u043c \u043e\u0447\u0435\u0440\u0435\u0434\u044c \u0432\u044b\u0431\u0438\u0440\u0430\u0435\u0442 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430. \u0410\u043b\u0433\u043e\u0440\u0438\u0442\u043c \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439:\
        <ul>\
            <li>\u0412\u044b\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044f \u043f\u0435\u0440\u0432\u044b\u0439 \u043d\u0435 \u0437\u0430\u043d\u044f\u0442\u044b\u0439 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u0438\u0437 \u0441\u043f\u0438\u0441\u043a\u0430 \u0434\u043e\u0447\u0435\u0440\u043d\u0438\u0445 \u0443\u0437\u043b\u043e\u0432 <b>selector</b>'\u0440\u0430 \
                (<b>CallsQueueOperatorRefNode</b>). \u0418\u043b\u0438 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 \u0437\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u043e\u043c, \u043d\u0430 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u043e\u0447\u0435\u0440\u0435\u0434\u044c \u043f\u044b\u0442\u0430\u043b\u0430\u0441\u044c \
                \u0434\u043e\u0437\u0432\u043e\u043d\u0438\u0442\u0441\u044f, \u043d\u043e \u043e\u043d \u043d\u0435 \u0432\u0437\u044f\u043b \u0442\u0440\u0443\u0431\u043a\u0443 \u0438\u043b\u0438 \u0431\u044b\u043b \u0437\u0430\u043d\u044f\u0442</li>\
            <li>\u0412\u044b\u043f\u043e\u043b\u043d\u044f\u0435\u0442\u0441\u044f \u0432\u044b\u0437\u043e\u0432 \u043d\u0430 \u043d\u043e\u043c\u0435\u0440\u0430 \u043d\u0435 \u0437\u0430\u043d\u044f\u0442\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u0438 \u0435\u0441\u043b\u0438 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043f\u043e\u0434\u043d\u044f\u043b \u0442\u0440\u0443\u0431\u043a\u0443, \u0442\u043e \u043d\u0430 \u044d\u0442\u043e\u043c \
                <b style="color:green">\u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0430 \u0432\u044b\u0437\u043e\u0432\u0430 \u0443\u0441\u043f\u0435\u0448\u043d\u043e \u0437\u0430\u043a\u0430\u043d\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044f</b></li>\
            <li>\u0415\u0441\u043b\u0438 \u043d\u0435 \u043e\u0434\u0438\u043d \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u043b \u0432\u044b\u0437\u043e\u0432, \u0442\u043e\u0433\u0434\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0438\u043c \u043a \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0435\u043c\u0443 \u0448\u0430\u0433\u0443</li>\
        </ul>\
    </li>\
    <li>\u0415\u0441\u043b\u0438 \u043d\u0438 \u043e\u0434\u0438\u043d \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u0432\u044b\u0437\u043e\u0432 \u043d\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u043b, \u0432\u044b\u043f\u043e\u043b\u043d\u044f\u044e\u0442\u0441\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f \u043e\u043f\u0438\u0441\u0430\u043d\u043d\u044b\u0435 \u0432 \u0443\u0437\u043b\u0435 <b>onBusyBehaviour</b>. \
        \u041f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 \u044d\u0442\u0438\u0445 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0439 \u043c\u043e\u0436\u043d\u043e: \
        <ul>\
        <li>\u043f\u043e\u0434\u0435\u0440\u0436\u0430\u0442\u044c \u0432\u044b\u0437\u043e\u0432 \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u043d\u043e\u0435 \u0432\u0440\u0435\u043c\u044f (\u0432\u0435\u0440\u043d\u0443\u0442\u044c \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u044c) (<b>WaitForOperatorOnBusyBehaviourStepNode</b>)</li>\
        <li>\u043f\u0435\u0440\u0435\u0432\u0435\u0441\u0442\u0438 \u0432\u044b\u0437\u043e\u0432 \u0432 \u0434\u0440\u0443\u0433\u0443\u044e \u043e\u0447\u0435\u0440\u0435\u043b\u044c (<b>MoveToQueueOnBusyBehaviourStepNode</b>)</li>\
        <li>\u0438\u043d\u0438\u0446\u0438\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0434\u0430\u043d\u043d\u044b\u0445 (<b>SendDataOnBusyBehaviourStepNode</b>)</li>\
        </ul>\
        <b style="color">\u0412\u0430\u0436\u043d\u043e!</b> \u0414\u0430\u0436\u0435 \u0435\u0441\u043b\u0438 \u0432\u044b\u0437\u043e\u0432 \u0431\u044b\u043b \u043f\u0435\u0440\u0435\u0432\u0435\u0434\u0435\u043d \u0432 \u0434\u0440\u0443\u0433\u0443\u044e \u043e\u0447\u0435\u0440\u0435\u0434\u044c, \u0442\u043e \u0446\u0435\u043f\u043e\u0447\u043a\u0430 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0439 <b>onBusyBehaviour</b>\
        \u043e\u0441\u0442\u0430\u0435\u0442\u0441\u044f \u043e\u0442 \u0442\u043e\u0439 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u0432 \u043a\u043e\u0442\u043e\u0440\u0443\u044e \u0432\u044b\u0437\u043e\u0432 \u043f\u043e\u043f\u0430\u043b \u043f\u0435\u0440\u0432\u044b\u043c\
        <br/>\
        \u041e\u0431\u044b\u0447\u043d\u043e \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f \u0432 \u0443\u0437\u043b\u0435 <b>onBusyBehaviour</b> \u0432\u044b\u043f\u043e\u043b\u043d\u044f\u044e\u0442\u0441\u044f \u043f\u043e\u0441\u043b\u0435\u0434\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u043d\u043e, \u043f\u043e \u043e\u0434\u043d\u043e\u043c\u0443 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044e \u043d\u0430 \u043a\u0430\u0436\u0434\u043e\u0435 \
        \u0432\u043e\u0437\u043d\u0438\u043a\u043d\u043e\u0432\u0435\u043d\u0438\u0435 \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u0438, \u043a\u043e\u0433\u0434\u0430 \u043d\u0438 \u043e\u0434\u0438\u043d \u043e\u043f\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u043b \u0432\u044b\u0437\u043e\u0432. \u041d\u043e \u0435\u0441\u0442\u044c \u0438\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f: \
        <ul>\
        <li><b>WaitForOperatorOnBusyBehaviourStepNode</b> \u043e\u0441\u0442\u0430\u0435\u0442\u0441\u044f \u043d\u0430 \u0441\u0432\u043e\u0435\u043c \u0448\u0430\u0433\u0435 (\u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442\u0441\u044f \u043d\u0430 \u044d\u0442\u043e\u0442 \u0448\u0430\u0433) \
            \u0434\u043e \u0442\u0435\u0445 \u043f\u043e\u0440 \u043f\u043e\u043a\u0430 \u043d\u0435 \u043a\u043e\u043d\u0447\u0438\u0442\u0441\u044f \u0432\u0440\u0435\u043c\u044f \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u0435 \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <b>waitTimeout</b>\
        </li>\
        <li>\u041f\u043e\u0441\u043b\u0435 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f <b>SendDataOnBusyBehaviourStepNode</b> \u043d\u0435\u0437\u0430\u043c\u0435\u0434\u043b\u0438\u0442\u0435\u043b\u044c\u043d\u043e \u0432\u044b\u043f\u043e\u043b\u043d\u044f\u0435\u0442\u0441\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0435\u0435</li>\
        </ul>\
    </li>\
    <li>\u0415\u0441\u043b\u0438 \u0437\u0430\u043a\u043e\u043d\u0447\u0438\u043b\u0438\u0441\u044c \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f \u0432 <b>onBusyBehaviour</b> \u0438\u043b\u0438 \u0438\u0445 \u0442\u0430\u043c \u043d\u0435 \u0431\u044b\u043b\u043e, \u0442\u043e\u0433\u0434\u0430 \u0432\u044b\u0437\u043e\u0432 \u043e\u0442\u043a\u043b\u043e\u043d\u044f\u0435\u0442\u0441\u044f</li>\
    </ul>\

maxQueueSize#description \u041c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440 \u043e\u0447\u0435\u0440\u0435\u0434\u0438. 
executor#description \u041d\u0438\u0442\u044c \u044d\u0442\u043e\u0433\u043e \u0438\u0441\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044f \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0430 \u0434\u043b\u044f \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438 \u043e\u0447\u0435\u0440\u0435\u0434\u0438
